# Sales Prediction from Exicuting Customer

# Importing Libraries

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
df=pd.read_csv(r"C:\Users\DELL\OneDrive\Documents\CSV Files\DigitalAd_dataset.csv")

# Summarize Dataset

In [ ]:
df.head()

   Age  Salary  Status
0   18   82000       0
1   29   80000       0
2   47   25000       1
3   45   26000       1
4   46   28000       1

In [ ]:
df.shape

(400, 3)

#### Lets check null values

In [ ]:
df.isnull().any()

Age       False
Salary    False
Status    False
dtype: bool

##### so no columns here which have null values

In [ ]:
df.describe()

              Age         Salary      Status
count  400.000000     400.000000  400.000000
mean    37.655000   69742.500000    0.357500
std     10.482877   34096.960282    0.479864
min     18.000000   15000.000000    0.000000
25%     29.750000   43000.000000    0.000000
50%     37.000000   70000.000000    0.000000
75%     46.000000   88000.000000    1.000000
max     60.000000  150000.000000    1.000000

##### Average sallary of costumer:

In [ ]:
print("Average salary of costumer is:",df.Salary.mean())

Average salary of costumer is: 69742.5

##### Average age of person purchasing product

In [ ]:
d=df[df['Status']==1]

In [ ]:
d.Age.mean()

46.39160839160839

# Segregate Dataset into X(independent variable) and Y(dependent Variable)

In [ ]:
x=df.iloc[:,:-1] #independent variable

In [ ]:
y=df.iloc[:,-1]   #dependent variable

# Splitting dataset into train and test

In [ ]:
from sklearn.model_selection import train_test_split

In [ ]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=0)

In [ ]:
x_train

     Age  Salary
336   38  113000
64    28   87000
55    31   68000
106   36   75000
300   39   79000
..   ...     ...
323   35   79000
192   55  130000
117   33   31000
47    25   87000
172   20   82000

[320 rows x 2 columns]

# Features Scalling

### we scale our data to make all the features contribute equally to the result

### Fit_transform:fit method calculated the mean and variance of each of the features present in the data

### Transform: this method is transform all the the features using respective mean and varience

In [ ]:
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()
x_train=sc.fit_transform(x_train)
x_test=sc.transform(x_test)

# Training Model

In [ ]:
from sklearn.linear_model import LogisticRegression

In [ ]:
LR_model=LogisticRegression()

In [ ]:
LR_model.fit(x_train,y_train)

LogisticRegression()

# Prediction

## Whether New costomer with Age and Salary will buy product or not

In [ ]:
age=int(input("Enter the Age:"))
sal=int(input("Enter the Salary:"))
input=[[age,sal]]

result=LR_model.predict(sc.transform(input))
if result==1:
    print("Costomer will Bye Product")
else:
    print("Costomer wont Bye Product ")

Enter the Age:25
Enter the Salary:500000
Costomer will Bye Product

In [ ]:
print(result)

[1]

## Prediction for all test Data

In [ ]:
predicted=LR_model.predict(x_test)
Actual=y_test

In [ ]:
df=pd.DataFrame({"predicted":predicted,"Actual":Actual})
df

     predicted  Actual
132          0       1
309          0       1
341          1       1
196          1       1
246          0       0
..         ...     ...
14           0       0
363          0       0
304          0       1
361          0       1
329          1       1

[80 rows x 2 columns]

# Let Reset Index

## drop

### It tries not to insert the index into the DataFrame columns. It resets the index of the concerned pandas DataFrame to the default integer index. It takes a boolean value i.e. True or False which is by default False.

In [ ]:
df.reset_index(drop=True)

    predicted  Actual
0           0       1
1           0       1
2           1       1
3           1       1
4           0       0
..        ...     ...
75          0       0
76          0       0
77          0       1
78          0       1
79          1       1

[80 rows x 2 columns]

In [ ]:
df

    predicted  Actual
0           0       1
1           0       1
2           1       1
3           1       1
4           0       0
..        ...     ...
75          0       0
76          0       0
77          0       1
78          0       1
79          1       1

[80 rows x 2 columns]

# Evaluating the Model :Confusion Matrix`

![WhatsApp%20Image%202022-03-20%20at%2011.43.50%20AM.jpeg](attachment:WhatsApp%20Image%202022-03-20%20at%2011.43.50%20AM.jpeg)

![WhatsApp%20Image%202022-03-20%20at%2011.48.09%20AM.jpeg](attachment:WhatsApp%20Image%202022-03-20%20at%2011.48.09%20AM.jpeg)

In [1]:
from sklearn.metrics import confusion_matrix,accuracy_score

In [ ]:
cm=confusion_matrix(Actual,predicted)

In [ ]:
print("Confusion Matrix :\n",cm)

Confusion Matrix :
 [[48  1]
 [16 15]]

In [ ]:
print("Accuracy Of the Model:\n",accuracy_score(Actual,predicted)*100,"%")

Accuracy Of the Model:
 78.75 %